# Homebrew Bundle
# https://github.com/Homebrew/homebrew-bundle

# ------------------------------------------------------------------------------
# Taps
# ------------------------------------------------------------------------------
tap "homebrew/bundle"
tap "homebrew/cask-fonts"


# ------------------------------------------------------------------------------
# CLI Tools
# ------------------------------------------------------------------------------
brew "gh"
brew "helm"
brew "k3d"
brew "k9s"
brew "kubernetes-cli"
brew "nvm"
brew "npm"
brew "pre-commit"
brew "poetry"
brew "terminal-notifier"
brew "watch"
brew "git"
brew "zsh"
brew "zsh-completions"
brew "coreutils"
brew "tree"
brew "lsd"
brew "wget"
brew "tldr"
brew "mas"
brew "wifi-password"
brew "bat"

# ------------------------------------------------------------------------------
# Cask
# ------------------------------------------------------------------------------

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hasklug-nerd-font"

# Development
cask "iterm2"

# Desktop applications
cask "google-chrome"
cask "docker"
cask "jetbrains-toolbox"
cask "postman"

