# Homebrew Bundle

# ------------------------------------------------------------------------------
# CLI Tools
# ------------------------------------------------------------------------------
brew "awscli"                   # https://aws.amazon.com/cli/
brew "bat"                      # https://github.com/sharkdp/bat
brew "gh"                       # https://github.com/cli/cli
brew "git"                      # https://git-scm.com/
brew "helm"                     # https://helm.sh/
brew "htop"                     # https://htop.dev/
brew "k3d"                      # https://k3d.io/
brew "k9s"                      # https://k9scli.io/
brew "kubectl"                  # https://kubernetes.io/docs/reference/kubectl/
brew "lsd"                      # https://github.com/lsd-rs/lsd
brew "mas"                      # https://github.com/mas-cli/mas
brew "node"                     # https://nodejs.org/ (includes npm)
brew "pre-commit"               # https://pre-commit.com/
brew "pygments"                 # https://pygments.org/
brew "terminal-notifier"        # https://github.com/julienXX/terminal-notifier
brew "tree"                     # https://linux.die.net/man/1/tree
brew "unbound"                  # https://nlnetlabs.nl/projects/unbound/about/
brew "uv"                       # https://github.com/astral-sh/uv
brew "watch"                    # https://linux.die.net/man/1/watch
brew "wget"                     # https://www.gnu.org/software/wget/
brew "zsh"                      # https://www.zsh.org/

# ------------------------------------------------------------------------------
# Cask Applications
# ------------------------------------------------------------------------------
cask "cursor"                   # https://www.cursor.com/
cask "docker-desktop"           # https://www.docker.com/
cask "font-fira-code"           # https://github.com/tonsky/FiraCode
cask "font-hack-nerd-font"      # https://github.com/ryanoasis/nerd-fonts
cask "google-chrome"            # https://www.google.com/chrome/
cask "iterm2"                   # https://iterm2.com/
cask "jetbrains-toolbox"        # https://www.jetbrains.com/toolbox-app/
cask "ngrok"                    # https://ngrok.com/
cask "postman"                  # https://www.postman.com/
cask "rectangle"                # https://rectangleapp.com/
cask "visual-studio-code"       # https://code.visualstudio.com/

